Revit 2026 API
LoadBase.RemoveHostConstraint Method
 Removes constraint from host for this load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void RemoveHostConstraint()
Public Sub RemoveHostConstraint
public:
void RemoveHostConstraint()
member RemoveHostConstraint : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This LoadBase is not a constraint load.
ModificationForbiddenException |  Thrown when the load is an AreaLoad and the host is an Analytical Panel with curved profile.
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace